<a href="https://colab.research.google.com/github/jgoncsilva/Classes_IronHack/blob/master/pandas_classes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# remember what Peter said about pandas in Belgium

# why Pandas?

# pandas was built on top of numpy but to take care also of textual data (strings)

In [ ]:
# when you have a pandas object with only one column -> Data Series

series = pd.Series(["Antero","Zoe","Gonçalo","Maria","Jhonatas"])

# a pandas series comes with an extra column for free!!!! -> index

In [ ]:
print(series)

0      Antero
1         Zoe
2     Gonçalo
3       Maria
4    Jhonatas
dtype: object

In [ ]:
# a dataframe is a bunch of pandas series side by side

In [ ]:
type(series)

pandas.core.series.Series

In [ ]:
# returns an iterable
series.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
series.index = range(2,7)

In [ ]:
# you can get the values of a series to a list
list(series)

['Antero', 'Zoe', 'Gonçalo', 'Maria', 'Jhonatas']

In [ ]:
# you can get the index of a series to a list
list(series.index)

[2, 3, 4, 5, 6]

In [ ]:
series.index = ['a','b','c','d','e']

In [ ]:
series

a      Antero
b         Zoe
c     Gonçalo
d       Maria
e    Jhonatas
dtype: object

In [ ]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

pd.Series(population_dict)

# pandas dataframes were created to interact naturally with objects like lists, dictionaries, tuples (+-) 
#data series only have ONE column -> if you want more, lets go to dataframes

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [ ]:
import numpy as np

In [ ]:
np.random.random((10,5))

array([[0.2758633 , 0.71922696, 0.20431616, 0.73376011, 0.15511824],
       [0.9592603 , 0.68184384, 0.05769742, 0.64455208, 0.03206029],
       [0.96365823, 0.5809659 , 0.94286597, 0.42191558, 0.27909865],
       [0.73575833, 0.06548449, 0.43994567, 0.5712165 , 0.50600908],
       [0.54557321, 0.22713313, 0.24840828, 0.20263257, 0.81714732],
       [0.84172006, 0.03504133, 0.76785729, 0.69912926, 0.41492911],
       [0.76830516, 0.02502433, 0.72380195, 0.76095501, 0.28660814],
       [0.26177696, 0.15129522, 0.13399669, 0.76725061, 0.62736501],
       [0.04236354, 0.56419128, 0.26687338, 0.98551782, 0.91460495],
       [0.56363061, 0.50301848, 0.71062689, 0.7044904 , 0.9569166 ]])

In [ ]:
pd.Series(np.random.random((10,5)))

Exception: ignored

In [ ]:
# wrong method, ups

pd.DataFrame(np.random.random((10,5)))

          0         1         2         3         4
0  0.864758  0.408322  0.558489  0.423084  0.387600
1  0.946420  0.603926  0.214243  0.921590  0.437752
2  0.909099  0.611293  0.408959  0.293084  0.368047
3  0.895050  0.306910  0.493219  0.927040  0.776364
4  0.570805  0.069451  0.509048  0.992167  0.840923
5  0.755669  0.253158  0.514186  0.009101  0.436270
6  0.538535  0.308619  0.633877  0.532703  0.884201
7  0.698288  0.183604  0.611364  0.572918  0.026852
8  0.234906  0.621471  0.923261  0.952945  0.937166
9  0.975778  0.846604  0.995037  0.843696  0.419746

In [ ]:
# maybe I need to give names to columns

# df is the universal variable we use to call dataframes
df = pd.DataFrame(np.random.random((10,5)), columns=['antero','Joan','Joao Inverno','Melissa','Jorge'])
#emea_df = pd.Data
df

     antero      Joan  Joao Inverno   Melissa     Jorge
0  0.148102  0.879422      0.629299  0.336867  0.436255
1  0.575235  0.647681      0.009154  0.017399  0.377947
2  0.847134  0.114069      0.728062  0.278509  0.757923
3  0.228328  0.878352      0.091171  0.122342  0.613815
4  0.750601  0.908247      0.533039  0.945024  0.711144
5  0.321937  0.628995      0.818928  0.070882  0.621834
6  0.188293  0.874026      0.832803  0.704578  0.392871
7  0.821067  0.277870      0.802189  0.959748  0.099311
8  0.978522  0.554457      0.365234  0.426383  0.227443
9  0.621418  0.852631      0.689077  0.142563  0.072908

In [ ]:
df.antero

0    0.744517
1    0.834116
2    0.716774
3    0.870836
4    0.784927
5    0.201550
6    0.552673
7    0.232253
8    0.718086
9    0.915616
Name: antero, dtype: float64

In [ ]:
#index as always
df['antero']

0    0.744517
1    0.834116
2    0.716774
3    0.870836
4    0.784927
5    0.201550
6    0.552673
7    0.232253
8    0.718086
9    0.915616
Name: antero, dtype: float64

In [ ]:
df[['antero','Melissa']]

     antero   Melissa
0  0.744517  0.035563
1  0.834116  0.244814
2  0.716774  0.060401
3  0.870836  0.980902
4  0.784927  0.858212
5  0.201550  0.800941
6  0.552673  0.670369
7  0.232253  0.157436
8  0.718086  0.040701
9  0.915616  0.058266

In [ ]:
df.columns = ["antero",'Alvaro','Diogo','Celina','Felipython']

In [ ]:
df

     antero    Alvaro     Diogo    Celina  Felipython
0  0.744517  0.120594  0.004551  0.035563    0.078004
1  0.834116  0.853601  0.126123  0.244814    0.128767
2  0.716774  0.530051  0.201437  0.060401    0.601391
3  0.870836  0.132513  0.033082  0.980902    0.065383
4  0.784927  0.608320  0.326805  0.858212    0.378618
5  0.201550  0.666621  0.844595  0.800941    0.245969
6  0.552673  0.450995  0.298544  0.670369    0.083146
7  0.232253  0.649242  0.233663  0.157436    0.542010
8  0.718086  0.897718  0.525341  0.040701    0.629457
9  0.915616  0.368716  0.689680  0.058266    0.766940

In [ ]:
# transposing in DataFrame
#compare to numpy
# array.transpose()
df.T

                   0         1         2  ...         7         8         9
antero      0.744517  0.834116  0.716774  ...  0.232253  0.718086  0.915616
Alvaro      0.120594  0.853601  0.530051  ...  0.649242  0.897718  0.368716
Diogo       0.004551  0.126123  0.201437  ...  0.233663  0.525341  0.689680
Celina      0.035563  0.244814  0.060401  ...  0.157436  0.040701  0.058266
Felipython  0.078004  0.128767  0.601391  ...  0.542010  0.629457  0.766940

[5 rows x 10 columns]

In [ ]:
# what is we want to import some cooler structures/datatypes?
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']

lst_lst = [[8450, 'CollgCr', 2003, 7, 208500],
           [9600, 'Veenker', 1976, 6, 181500],
           [11250, 'CollgCr', 2001, 7, 223500],
           [9550, 'Crawfor', 1915, 7, 140000],
           [14260, 'NoRidge', 2000, 8, 250000],
           [14115, 'Mitchel', 1993, 5, 143000],
           [10084, 'Somerst', 2004, 8, 307000],
           [10382, 'NWAmes', 1973, 7, 200000],
           [6120, 'OldTown', 1931, 7, 129900],
           [7420, 'BrkSide', 1939, 5, 118000]]

In [ ]:
data = pd.DataFrame(lst_lst, columns=colnames)
data

   LotSize Neighborhood  YearBuilt  Quality  SalePrice
0     8450      CollgCr       2003        7     208500
1     9600      Veenker       1976        6     181500
2    11250      CollgCr       2001        7     223500
3     9550      Crawfor       1915        7     140000
4    14260      NoRidge       2000        8     250000
5    14115      Mitchel       1993        5     143000
6    10084      Somerst       2004        8     307000
7    10382       NWAmes       1973        7     200000
8     6120      OldTown       1931        7     129900
9     7420      BrkSide       1939        5     118000

In [ ]:
# you never iterate over the rows!!! -> you manipulate the data, always refering to the columns
data['price_per_m2'] = data['SalePrice']/data['LotSize']

In [ ]:

#data
#= A1/B2

   LotSize Neighborhood  YearBuilt  Quality  SalePrice  price_per_m2
0     8450      CollgCr       2003        7     208500     24.674556
1     9600      Veenker       1976        6     181500     18.906250
2    11250      CollgCr       2001        7     223500     19.866667
3     9550      Crawfor       1915        7     140000     14.659686
4    14260      NoRidge       2000        8     250000     17.531557
5    14115      Mitchel       1993        5     143000     10.131066
6    10084      Somerst       2004        8     307000     30.444268
7    10382       NWAmes       1973        7     200000     19.264111
8     6120      OldTown       1931        7     129900     21.225490
9     7420      BrkSide       1939        5     118000     15.902965

In [ ]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

data = pd.DataFrame(house_dict)
data

  Baker House Beazley House  ... Snyder House Zuckerman House
0        7420         14115  ...        10084           10382
1     BrkSide       Mitchel  ...      Somerst          NWAmes
2        1939          1993  ...         2004            1973
3           5             5  ...            8               7
4      118000        143000  ...       307000          200000

[5 rows x 10 columns]

In [ ]:
# dataframe calculations work (by default) row by row!!
data['alvaro'] = data['Baker House'] + data['James House']

In [ ]:
data

  Baker House Beazley House  ... Zuckerman House          alvaro
0        7420         14115  ...           10382           18670
1     BrkSide       Mitchel  ...          NWAmes  BrkSideCollgCr
2        1939          1993  ...            1973            3940
3           5             5  ...               7              12
4      118000        143000  ...          200000          341500

[5 rows x 11 columns]

In [ ]:
data = data.transpose()

In [ ]:
data.columns = colnames

data

                LotSize    Neighborhood YearBuilt Quality SalePrice
Baker House        7420         BrkSide      1939       5    118000
Beazley House     14115         Mitchel      1993       5    143000
Dominguez House   14260         NoRidge      2000       8    250000
Hamilton House     6120         OldTown      1931       7    129900
James House       11250         CollgCr      2001       7    223500
Martinez House     9600         Veenker      1976       6    181500
Roberts House      9550         Crawfor      1915       7    140000
Smith House        8450         CollgCr      2003       7    208500
Snyder House      10084         Somerst      2004       8    307000
Zuckerman House   10382          NWAmes      1973       7    200000
alvaro            18670  BrkSideCollgCr      3940      12    341500

In [ ]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [ ]:
# how could I get directly the best datastructure in one line?
# orient parameter allows you to define the orientation in which you will import your data
data =pd.DataFrame.from_dict(house_dict, orient='index',columns = colnames)
# I want the keys of the dictionary to becomes the index of the dataframe
data

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [ ]:
# you can also do mathematical function on these things

# Total Price of the houses

data['SalePrice'].sum()

1901400

In [ ]:
# average Price of the houses

data['SalePrice'].mean()

190140.0

In [ ]:
# read data from a csv

# this csv is a "database" of the sales of a company
pd.read_csv("Sample - EU Superstore.csv")

      Row ID         Order ID  Order Date  ... Quantity Discount  Profit
0          1  ES-2017-1311038  07/02/2017  ...        3      0.0   39.60
1          2  ES-2017-1311038  07/02/2017  ...        7      0.0    0.00
2          3  ES-2017-1311038  07/02/2017  ...        3      0.0   16.11
3          4  ES-2017-1311038  07/02/2017  ...        2      0.0   13.20
4          5  ES-2017-1311038  07/02/2017  ...        3      0.0   73.71
...      ...              ...         ...  ...      ...      ...     ...
9995    9996  ES-2014-3780358  16/11/2014  ...        2      0.0   23.88
9996    9997  ES-2015-5371207  25/01/2015  ...        1      0.0    0.57
9997    9998  ES-2015-5371207  25/01/2015  ...        6      0.0   28.98
9998    9999  ES-2015-5371207  25/01/2015  ...        7      0.0  221.13
9999   10000  ES-2015-5371207  25/01/2015  ...        6      0.0   50.22

[10000 rows x 20 columns]